# jokes.py
import random

# Global jokes list (English + Hindi + Marathi)
jokes_list = [
   

    # Hindi jokes
    "😄 पति: अगर मैं खो जाऊं तो तुम क्या करोगी?\nपत्नी: मैं अख़बार में इश्तिहार दूंगी।\nपति: क्या लिखवाओगी?\nपत्नी: 'खो गया पति, मिलने वाले को इनाम मिलेगा!'",
    "🤣 शिक्षक: बताओ बिजली क्यों आती है?\nछात्र: क्योंकि बिजली बिल भरने आता है।",

    # Marathi jokes
    "😆 मित्र: तू इतका झोपतोस का?\nमित्रा: हो, स्वप्नात देखील मी ऑफिसमध्ये जातो.",
    "😂 आई: काय खाल्ले रे आज?\nबाळ: जेवणात खाऊन झोपलो, स्वप्नातही बिर्याणी खाल्ली!",
    "😁 शिक्षक: पप्पा, गणितात लक्ष द्या.\nपप्पा: सर, मी स्वप्नातही गण्याचे उत्तर शोधतो."
]

def tell_joke():
    joke = random.choice(jokes_list)
    return joke
